---
kind: property
id: P:Autodesk.Revit.DB.SharedParameterElement.GuidValue
source: html/5f6a55c4-a80f-225a-c26b-45e89e91c74c.htm
---
# Autodesk.Revit.DB.SharedParameterElement.GuidValue Property

The Guid that identifies this shared parameter.

## Syntax (C#)
```csharp
public Guid GuidValue { get; }
```